In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

# 1) First Class, how to read a data file into pandas?

In [14]:
orders = pd.read_table('http://bit.ly/chiporders')
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [20]:
use_cols = ['user_ic','age','gender','occupation','zip_code']
users = pd.read_table('http://bit.ly/movieusers',sep = '|', header = None, names = use_cols)
users.head()

   user_ic  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# 2) Class two, how to select a pandas series from a DataFrame?

In [22]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [23]:
type(ufo) #This shows us the type of object that is the file ufo. As we expected, it's a DataFrame type.

pandas.core.frame.DataFrame

In [24]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [27]:
ufo['City']; #We select a serie by using bracket notation. 
type(ufo['City']) # With type() we check that the type of object we select is a serie, indeed.

pandas.core.series.Series

In [30]:
ufo.City; # We can select a serie by using dot notation as well. 
type(ufo.City)

pandas.core.series.Series

In [38]:
# How to create a new serie from the original DataFrame? We use the same technique as strings, we use plus sign.
ufo.City+ufo.State; # This put the City just next to the Sate, and this is not helfpul at all. We can fix it.
ufo['City']+ufo['State']; # This produces the same result.

In [40]:
ufo.City+', '+ufo.State; #By adding a comma between the series, we orgnize the serie in a better way.
ufo['City']+', '+ufo['State']; # This produces the same resulting serie as the previous line.

In [35]:
# If we want to create a new column with the previous serie, the resulting of adding two series, 
# We have to use bracket notation.
ufo['Location'] = ufo.City+', '+ufo.State

In [36]:
ufo.head() # We can see here the last column added is a combination of two series, Location.

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

# 3) Third class, why some commands end with parenthesis, and others don't?

In [2]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [3]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [4]:
movies.describe() #Describes shows you a description of the statistics of all numerical columns.

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [5]:
movies.shape

(979, 6)

In [6]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

**The resons for which some expressions have parenthesis and others don't are that the DataFrame type has methods
and attributes. The methods are like actions, tasks made by the Data Frame. For instance, df.head() means "please, return the head", and df.describe() means "please, compute the statistics". Now, the attributes are characteristics of the Data Frame. For instance, df.shape means "characteristic of shape is:", the same idea with df.dtype.**

In [7]:
movies.describe(include='object')

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,True Grit,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

# Cheking arguments of a method.
If you want to review the arguments of a method, you have to hit shift+tab.
* one time and it shows a brief list with the arguments or parameters.
* twice and it shows a bigger window with more information.
* three times and the window satays longer.
* four times and the window gets bigger and it covers half of the browser.

#  4) Fourth classe, How to rename the columns of a Data Frame?

In [30]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [31]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [11]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

**Let's suppose that we want to rename the column "Shape Reported" and "Colors Reported", how do i do that?**

In [14]:
ufo.rename(columns = {'Colors Reported':'Colors_Reported','Shape Reported':'Shape_Reported'},inplace=True)

If we want to rename a column we have to use the .rename() method, we pass the parameters as columns = {'old name':'new name'}
and the parameter inplace = True, so we make the change very there.

In [15]:
ufo.columns #Notice that the names of two columns changed.

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

**Is there another way of renaming the columns of a Data Frame? What if I want to replace all these column names?**
* Create a list with new column names, for instance, new_cols=['name1','name2','name3','name4','name5']
* Then we just pass the list of names to the attribute df.columns = new_cols.
* This overwrite the name of the columns automatially.

In [17]:
new_name_cols = ['city','colors reported','shape reported','state','time']

In [18]:
ufo.columns = new_name_cols

In [20]:
ufo.columns # Notice that now all the name columns are written in lower case.

Index(['city', 'colors reported', 'shape reported', 'state', 'time'], dtype='object')

**Is there another way? Yes, there's a third way of renaming the columns.**
* We just pass the list of the new names as argument of the pd...read_csv() method.

In [32]:
spanish_cols = ['ciudad','color reportado','forma reportada','provincia','hora']
ufo = pd.read_csv('http://bit.ly/uforeports',names = spanish_cols, header=0)

In [33]:
ufo.head()

,ciudad,color reportado,forma reportada,provincia,hora
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

# What happens if I have hundreds of columns and I want the spaces with underscores?

We can use a string method for the attribute columns.

In [34]:
ufo.columns = ufo.columns.str.replace(' ','_')

In [35]:
ufo.head()

,ciudad,color_reportado,forma_reportada,provincia,hora
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

# 5) Fifth class, how to remove columns?

In [40]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [41]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [42]:
ufo.drop('Colors Reported',axis=1, inplace=True) #this is only for just one column.

In [43]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [44]:
ufo.drop(['City','State'],axis=1,inplace=True)

In [45]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [53]:
ufo.drop([1,2,3,4,5],axis=0,inplace=True)

In [54]:
ufo.head()

   Shape Reported              Time
6          CIRCLE    6/15/1935 0:00
7            DISK    7/15/1936 0:00
8           CIGAR  10/15/1936 17:00
9        CYLINDER    6/15/1937 0:00
10          LIGHT   8/15/1937 21:00